In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [1, 3, 5, 7, 9]
pd.DataFrame(data)  # sayisal indexleri default verdi

   0
0  1
1  3
2  5
3  7
4  9

In [3]:
pd.DataFrame(data, columns=["Col1"])

   Col1
0     1
1     3
2     5
3     7
4     9

In [4]:
pd.DataFrame(data,columns=["Col1"])

   Col1
0     1
1     3
2     5
3     7
4     9

In [5]:
pd.DataFrame(data = data, columns=["column_1"], index=['a', 'b', 'c', 'd', 'e'])

   column_1
a         1
b         3
c         5
d         7
e         9

In [6]:
data= np.arange(1,24,2).reshape(3,4)
data

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [7]:
df = pd.DataFrame(data = data, columns=["var1","var2","var3","var4"])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [8]:
s1 = np.random.randint(2, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)

In [10]:
mydict = {"var1":s1,"var2":s2,"var3":s3}
mydict

{'var1': array([7, 8, 9, 3]),
 'var2': array([8, 5, 4, 4]),
 'var3': array([11, 11, 14, 13])}

In [11]:
df = pd.DataFrame(mydict)

In [12]:
df.head(4)

   var1  var2  var3
0     7     8    11
1     8     5    11
2     9     4    14
3     3     4    13

In [13]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [14]:
for col in df.columns: # köseli parantezden cikarmak icin...
    print(col)

var1
var2
var3

In [17]:
df.mean(axis =1)

0    8.666667
1    8.000000
2    9.000000
3    6.666667
dtype: float64

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df.index[2]

2

In [19]:
df.columns = ["new1", "new2", "new3"]
df   # bütün column isimlerini degistirmek gerekir

   new1  new2  new3
0     7     8    11
1     8     5    11
2     9     4    14
3     3     4    13

In [21]:
df.values

array([[ 7,  8, 11],
       [ 8,  5, 11],
       [ 9,  4, 14],
       [ 3,  4, 13]])

In [23]:
df

   new1  new2  new3
0     7     8    11
1     8     5    11
2     9     4    14
3     3     4    13

In [24]:
df.index = ["a", "b", "c", "d"] #data frame create ederken, olusan dataya müdahele etmek gerekirse kullaniriz
df

   new1  new2  new3
a     7     8    11
b     8     5    11
c     9     4    14
d     3     4    13

In [27]:
df.rename(index = {"a":1, "b":2}, inplace = True) # istedigimiz kadar column isimlerini degistirebiliriz

In [28]:
df

   new1  new2  new3
1     7     8    11
2     8     5    11
c     9     4    14
d     3     4    13

In [29]:
df.shape

(4, 3)

In [30]:
df.shape[1]

3

In [31]:
len(df)

4

In [35]:
df.count(axis=1)# axis = 0 #sürun bazinda

1    3
2    3
c    3
d    3
dtype: int64

In [36]:
type(df["new1"])

pandas.core.series.Series

In [38]:
"new2" in df

True

In [39]:
from numpy.random import randn

In [40]:
np.random.seed(101)
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[["Y","Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop()  # label kullanacaksan axis belirle, label axis =1 columnn, kolonda arar.yazmazsan default 
# axis = 0 oldugu icin ABC de arar...

In [45]:
data = np.random.randint(1, 40, size=(8, 4))

df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [50]:
df.loc[(df["var2"] > 10) & (df["var3"]<30), ["var2", "var3"]]

   var2  var3
2    18    12
3    30    25
5    28     9